
出险次数大于一<-new_train[which(new_train$出险次数>=1),]
回归训练<-sample(1:233701,186960)

train_后回归<-出险次数大于一[回归训练,]
test_后回归<-出险次数大于一[-回归训练,]

泊松回归<-gamlss(出险次数     ~     上年出险次数+
                   使用性质+
                   车辆已使用年限+
                   续保年限+
                   分公司代码+
                   业务渠道+
                   实际价值+
                   被保人性别+
                   连续被续保年限+
                   被续保标志+
                   机动车大类+
                   车辆生产国别+
                   被保人年龄+
                   是否约定驾驶员标志+
                   被保人与车辆关系+
                   本车是否投保不计免赔标识 +
                   车损险附加险个数+
                   车损险保费, data = train_后回归, family = NBI)

summary(泊松回归)
plot(泊松回归)
泊松回归结果 <-predict(泊松回归, newdata = test_后回归, type = "response")
quantile(泊松回归结果)
plot(泊松回归结果)

泊松回归结果[which(泊松回归结果 >= 0 &
                     泊松回归结果 < 1.5)] <- 1
泊松回归结果[which(泊松回归结果 >= 1.5 &
                     泊松回归结果 <=2)] <- 2
泊松回归结果 <- ceiling(泊松回归结果)

length(which(abs(test_后回归$出险次数 - 泊松回归结果) >= 1))##13193
length(test_后回归$出险次数)##46741

length(泊松回归结果==3)
table(泊松回归结果)
table(test_后回归$出险次数,泊松回归结果)
